qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083_adc.h
/******************************************************************************
 ** Global type definitions
 *****************************************************************************/

/** @defgroup ADC_OpMode
  * @{
  */
#define ADC_SingleChOneMode                  ((uint32_t)0x00000000)
#define ADC_SingleChMoreMode                 ((uint32_t)0x00000002)
#define ADC_SingleChContinuousMode           ((uint32_t)0x00000004)
#define ADC_SerialChContinuousMode           ((uint32_t)0x00000006)
#define ADC_SerialChScanMode                 ((uint32_t)0x00000008)
#define ADC_SerialChMoreMode                 ((uint32_t)0x0000000A)
#define ADC_SerialChBreakMode                ((uint32_t)0x0000000C)


#define IS_ADC_OP_MODE(OP_MODE)              (((OP_MODE) == ADC_SingleChOneMode)         || \
                                             ((OP_MODE) == ADC_SingleChMoreMode)         || \
                                             ((OP_MODE) == ADC_SingleChContinuousMode)   || \
                                             ((OP_MODE) == ADC_SerialChContinuousMode)   || \
                                             ((OP_MODE) == ADC_SerialChScanMode)         || \
                                             ((OP_MODE) == ADC_SerialChMoreMode)         || \
                                             ((OP_MODE) == ADC_SerialChBreakMode))


/** @defgroup ADC_ClkDiv
  * @{
  */
#define ADC_Clk_Div1                         ((uint32_t)0x00000000)
#define ADC_Clk_Div2                         ((uint32_t)0x00000100)
#define ADC_Clk_Div4                         ((uint32_t)0x00000200)
#define ADC_Clk_Div8                         ((uint32_t)0x00000300)
#define ADC_Clk_Div16                        ((uint32_t)0x00000400)
#define ADC_Clk_Div32                        ((uint32_t)0x00000500)
#define ADC_Clk_Div64                        ((uint32_t)0x00000600)
#define ADC_Clk_Div128                       ((uint32_t)0x00000700)

#define IS_ADC_CLK_DIV(CLK_DIV)              (((CLK_DIV) == ADC_Clk_Div1)   || \
                                             ((CLK_DIV) == ADC_Clk_Div2)    || \
                                             ((CLK_DIV) == ADC_Clk_Div4)    || \
                                             ((CLK_DIV) == ADC_Clk_Div8)    || \
                                             ((CLK_DIV) == ADC_Clk_Div16)   || \
                                             ((CLK_DIV) == ADC_Clk_Div32)   || \
                                             ((CLK_DIV) == ADC_Clk_Div64)   || \
                                             ((CLK_DIV) == ADC_Clk_Div128))



/** @defgroup ADC_VrefSel
  * @{
  */
#define ADC_Vref_BGR1p5                      ((uint32_t)0x00000000)
#define ADC_Vref_BGR2p5                      ((uint32_t)0x00000040)
#define ADC_Vref_Extern1                     ((uint32_t)0x00000080)
#define ADC_Vref_VDDA                        ((uint32_t)0x000000C0)

#define IS_ADC_VREF_SEL(VREF_SEL)            (((VREF_SEL) == ADC_Vref_BGR1p5)   || \
                                             ((VREF_SEL) == ADC_Vref_BGR2p5)    || \
                                             ((VREF_SEL) == ADC_Vref_Extern1)   || \
                                             ((VREF_SEL) == ADC_Vref_VDDA))



/** @defgroup ADC_ChSel
  * @{
  * 通道0输入PA00
  * 通道1输入PA01
  * 通道2输入PA02
  * 通道3输入PA03
  * 通道4输入PA04
  * 通道5输入PA05
  * 通道6输入PA06
  * 通道7输入PA07
  * 通道8输入PC04
  * 通道9输入PC05
  * 通道10输入PB00
  * 通道11输入PB01
  * 通道12输入PB02
  * VDDA/3(必须使用输入增益)
  * BGR_TS(必须使用输入增益)
  * Vref1P2(必须使用输入增益)
  */
#define ADC_ExInputCH0                       ((uint32_t)0x00000000)
#define ADC_ExInputCH1                       ((uint32_t)0x00000001)
#define ADC_ExInputCH2                       ((uint32_t)0x00000002)
#define ADC_ExInputCH3                       ((uint32_t)0x00000003)
#define ADC_ExInputCH4                       ((uint32_t)0x00000004)
#define ADC_ExInputCH5                       ((uint32_t)0x00000005)
#define ADC_ExInputCH6                       ((uint32_t)0x00000006)
#define ADC_ExInputCH7                       ((uint32_t)0x00000007)
#define ADC_ExInputCH8                       ((uint32_t)0x00000008)
#define ADC_ExInputCH9                       ((uint32_t)0x00000009)
#define ADC_ExInputCH10                      ((uint32_t)0x0000000A)
#define ADC_ExInputCH11                      ((uint32_t)0x0000000B)
#define ADC_ExInputCH12                      ((uint32_t)0x0000000C)
#define ADC_VddaDiV3Input                    ((uint32_t)0x0000000D)
#define ADC_TsInput                          ((uint32_t)0x0000000E)
#define ADC_Vref1P2Input                     ((uint32_t)0x0000000F)

#define IS_ADC_CH_SEL(CH_SEL)                (((CH_SEL) == ADC_ExInputCH0)    || \
                                             ((CH_SEL) == ADC_ExInputCH1)     || \
                                             ((CH_SEL) == ADC_ExInputCH2)     || \
                                             ((CH_SEL) == ADC_ExInputCH3)     || \
                                             ((CH_SEL) == ADC_ExInputCH4)     || \
                                             ((CH_SEL) == ADC_ExInputCH5)     || \
                                             ((CH_SEL) == ADC_ExInputCH6)     || \
                                             ((CH_SEL) == ADC_ExInputCH7)     || \
                                             ((CH_SEL) == ADC_ExInputCH8)     || \
                                             ((CH_SEL) == ADC_ExInputCH9)     || \
                                             ((CH_SEL) == ADC_ExInputCH10)    || \
                                             ((CH_SEL) == ADC_ExInputCH11)    || \
                                             ((CH_SEL) == ADC_ExInputCH12)    || \
                                             ((CH_SEL) == ADC_VddaDiV3Input)  || \
                                             ((CH_SEL) == ADC_TsInput)        || \
                                             ((CH_SEL) == ADC_Vref1P2Input))

