qinikat/CW32-LowPowerBroadcastModule/Libraries/inc/cw32l083_adc.h
    uint32_t      ADC_TsEn;        /*内置温度传感器使能*/

    uint32_t      ADC_DMASOCEn;    /*ADC转换完成触发DMA使能*/

    uint32_t      ADC_Align;       /*ADC转换结果对齐方式*/

    uint32_t      ADC_AccEn;       /*转换结果累加使能*/
} ADC_InitTypeDef;

/**
 ******************************************************************************
 ** @brief  ADC模拟看门狗配置
 *****************************************************************************/
typedef struct
{
    uint32_t    ADC_WdtCh;       /*ADC模拟看门狗通道*/

    uint32_t    ADC_WdtAll;      /*ADC模拟看门狗使能*/

    uint32_t    ADC_WdtrIrq;     /*ADC区间模拟看门狗使能*/

    uint32_t    ADC_WdthIrq;     /*ADC上超出模拟看门狗使能*/

    uint32_t    ADC_WdtlIrq;     /*ADC下超出模拟看门狗使能*/

    uint32_t    ADC_Vth;         /*ADC模拟看门狗上阈值*/

    uint32_t    ADC_Vtl;         /*ADC模拟看门狗下阈值*/
} ADC_WdtTypeDef;

/**
 ******************************************************************************
 ** @brief  ADC单通道配置
 *****************************************************************************/
typedef struct
{
    uint32_t          ADC_Chmux;      /*ADC单通道转换模式待转换通道*/

    uint32_t          ADC_DiscardEn;  /*单通道ADC转换结果保存策略配置*/

    ADC_InitTypeDef   ADC_InitStruct; /*ADC初始化*/

    ADC_WdtTypeDef    ADC_WdtStruct;  /*ADC模拟看门狗配置*/
} ADC_SingleChTypeDef;

/**
 ******************************************************************************
 ** @brief  ADC序列配置
 *****************************************************************************/
typedef struct
{
    uint32_t         ADC_SqrEns;      /*ADC序列转换的序列配置*/
  
    uint32_t         ADC_Sqr7Chmux;   /*ADC序列7待转换通道*/
  
    uint32_t         ADC_Sqr6Chmux;   /*ADC序列6待转换通道*/
  
    uint32_t         ADC_Sqr5Chmux;   /*ADC序列5待转换通道*/
  
    uint32_t         ADC_Sqr4Chmux;   /*ADC序列4待转换通道*/
  
    uint32_t         ADC_Sqr3Chmux;   /*ADC序列3待转换通道*/
  
    uint32_t         ADC_Sqr2Chmux;   /*ADC序列2待转换通道*/
  
    uint32_t         ADC_Sqr1Chmux;   /*ADC序列1待转换通道*/
  
    uint32_t         ADC_Sqr0Chmux;   /*ADC序列0待转换通道*/
  
    uint32_t         ADC_DMASOFEn;    /*ADC序列转换完成触发DMA使能*/

    ADC_InitTypeDef  ADC_InitStruct;  /*ADC初始化*/
} ADC_SerialChTypeDef;


/**
 ******************************************************************************
 ** @brief  ADC中断配置
 *****************************************************************************/
typedef struct
{
    boolean_t  ADC_ReadyFlag; /*ADC初始化完成标志*/

    boolean_t  ADC_OvwIrq;    /*ADC转换结果溢出中断*/

    boolean_t  ADC_WdtrIrq;   /*ADC模拟看门狗区间中断*/

    boolean_t  ADC_WdthIrq;   /*ADC模拟看门狗上阈值中断*/

    boolean_t  ADC_WdtlIrq;   /*ADC模拟看门狗下阈值中断*/

    boolean_t  ADC_EoaIrq;    /*ADC多次转换完成中断*/

    boolean_t  ADC_EosIrq;    /*ADC序列转换完成中断*/

    boolean_t  ADC_EocIrq;    /*ADC单次转换完成中断*/
} ADC_IrqTypeDef;





/******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/******************************************************************************
 * Global function prototypes (definition in C source)
 ******************************************************************************/
//ADC去初始化
void ADC_DeInit(void);
//ADC初始化
void ADC_Init(ADC_InitTypeDef* ADC_InitStruct);
//ADC默认值初始化
void ADC_StructInit(ADC_InitTypeDef* ADC_InitStruct);
//ADC模拟看门狗默认值初始化
void ADC_WdtInit(ADC_WdtTypeDef* ADC_WdtStruct);
//ADC使能
int ADC_Enable(void);
//ADC禁用
void ADC_Disable(void);

//触发DMASOC读取命令
void ADC_DmaSocCmd(FunctionalState NewState);
//触发DMASOC读取使能
void ADC_DmaSocEnable(void);
//触发DMASOC读取禁止
void ADC_DmaSocDisable(void);

//触发DMASOF读取命令
void ADC_DmaSofCmd(FunctionalState NewState);
//触发DMASOF读取使能
void ADC_DmaSofEnable(void);
//触发DMASOF读取禁止
void ADC_DmaSofDisable(void);

//ADC转换软件启动命令
void ADC_SoftwareStartConvCmd(FunctionalState NewState);
//ADC外部中断触发源配置
void ADC_ExtTrigCfg(uint16_t ADC_TRIG, FunctionalState NewState);

//单通道转换模式公共配置
void ADC_SingleChCommon(ADC_SingleChTypeDef* ADC_SingleChStruct);
//ADC单通道单次转换模式配置
void ADC_SingleChOneModeCfg(ADC_SingleChTypeDef* ADC_SingleChStruct);
//ADC单通道多次转换模式配置
void ADC_SingleChMoreModeCfg(ADC_SingleChTypeDef* ADC_SingleChStruct, uint8_t cntAdcSample);
//ADC单通道连续转换模式配置
void ADC_SingleChContinuousModeCfg(ADC_SingleChTypeDef* ADC_SingleChStruct);
//ADC序列转换模式公共配置
void ADC_SerialChCommon(ADC_SerialChTypeDef* ADC_SerialChStruct);
//ADC序列连续转换模式配置
void ADC_SerialChContinuousModeCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);
//ADC序列扫描转换模式配置
void ADC_SerialChScanModeCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);
//ADC序列多次转换模式配置
void ADC_SerialChMoreModeCfg(ADC_SerialChTypeDef* ADC_SerialChStruct, uint8_t cntAdcSample);
//ADC序列断续转换模式配置
void ADC_SerialChBreakModeCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);

//序列SQR0转换通道配置
void ADC_Sqr0ChannelCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);
//序列SQR0/SQR1转换通道配置
void ADC_Sqr01ChannelCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);
//序列SQR0~SQR2转换通道配置
void ADC_Sqr02ChannelCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);
//序列SQR0~SQR3转换通道配置
void ADC_Sqr03ChannelCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);
//序列SQR0~SQR4转换通道配置
void ADC_Sqr04ChannelCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);
//序列SQR0~SQR5转换通道配置
void ADC_Sqr05ChannelCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);
//序列SQR0~SQR6转换通道配置
void ADC_Sqr06ChannelCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);
//序列SQR0~SQR7转换通道配置
void ADC_Sqr07ChannelCfg(ADC_SerialChTypeDef* ADC_SerialChStruct);

//设置单通道模式
void ADC_SetSingleCh( uint32_t enAdcSampCh);
//设置序列模式
void ADC_SetSerialCh( uint32_t enAdcSampCh);

//ADC模拟看门狗配置
void ADC_WdtConfig(ADC_WdtTypeDef* ADC_WdtStruct);

//ADC中断配置
void ADC_ITConfig(uint16_t ADC_IT, FunctionalState NewState);
//ADC中断使能
void ADC_EnableIrq(uint8_t intPriority);
//ADC中断禁止
void ADC_DisableIrq(void);
//使能NVIC中ADC中断
void ADC_EnableNvic(uint8_t intPriority);
//禁用NVIC中ADC中断
void ADC_DisableNvic(void);
//获取ADC所有中断状态
void ADC_GetITStatusAll(volatile uint8_t* pFlagAdcIrq);
//获取ADC指定的中断状态
ITStatus ADC_GetITStatus(uint16_t ADC_IT);
//清除ADC所有中断状态
void ADC_ClearITPendingAll(void);
//清除ADC指定的中断状态
void ADC_ClearITPendingBit(uint16_t ADC_IT);

//获取单次转换采样值
uint16_t ADC_GetConversionValue(void);
//获取SQR0通道采样值
void ADC_GetSqr0Result(uint16_t* pAdcResult);
//获取SQR1通道采样值
void ADC_GetSqr1Result(uint16_t* pAdcResult);
//获取SQR2通道采样值
void ADC_GetSqr2Result(uint16_t* pAdcResult);
//获取SQR3通道采样值
void ADC_GetSqr3Result(uint16_t* pAdcResult);
//获取SQR4通道采样值
void ADC_GetSqr4Result(uint16_t* pAdcResult);
//获取SQR5通道采样值
void ADC_GetSqr5Result(uint16_t* pAdcResult);
//获取SQR6通道采样值
void ADC_GetSqr6Result(uint16_t* pAdcResult);
//获取SQR7通道采样值
void ADC_GetSqr7Result(uint16_t* pAdcResult);
//获取累加采样值
void ADC_GetAccResult(uint32_t* pAdcAccResult);
//清零累加采样值
void ADC_ClrAccResult(void);

//设置参考电压
void ADC_SetVref(uint32_t ADC_VrefSel);
//设置结果对齐方式
void ADC_SetAlign(uint32_t enAlign);
//设置单通道ADC转换结果溢出保存策略
void ADC_SetDiscard(uint32_t enDiscard);
//设置内置温度传感器使能控制
void ADC_SetTs(uint32_t enTs);
//读取ADC参考电压1.5V时的温度传感器的测量温度
void ADC_GetTsVref1V5(float* fAdcTsDegree);
//读取ADC参考电压2.5V时的温度传感器的测量温度
void ADC_GetTsVref2V5(float* fAdcTsDegree);
//设置ADC转换结束自动停止
void ADC_AutoStop(uint32_t enAutoStop);
//@}
#ifdef __cplusplus
}
#endif

#endif /* __CW32L083_ADC_H */
/******************************************************************************/
/* EOF (not truncated)                                                        */
/******************************************************************************/
